let a = 10;

switch (a) {
  case 10:
    console.log('Верно');
    break;
  default:
    console.log('Неверно');
}

// ********************************************************************************************
let min = 30;

switch (true) {
  case (min >= 0 && min <= 14):
    console.log('Первая четверть часа');
    break;
  case (min >= 15 && min <= 29):
    console.log('Вторая четверть часа');
    break;
  case (min >= 30 && min <= 44):
    console.log('Третья четверть часа');
    break;
  default:
    console.log('Четвертая четверть часа');
}

// ********************************************************************************************
let a = 'тест';

switch (a) {
  case 'test':
    console.log('Верно');
    break;
  default:
    console.log('Неверно');
}

// ********************************************************************************************
let a = '1';

switch (a) {
  case '1':
    console.log('Верно');
    break;
  default:
    console.log('Неверно');
}

// ********************************************************************************************
let num = 3;
let result;

switch (num) {
  case 1:
    result = 'зима';
    break;
  case 2:
    result = 'весна';
    break;
  case 3:
    result = 'лето';
    break;
  case 4:
    result = 'осень';
    break;
  default:
    result = 'неверное значение';
}

console.log(result);

// ********************************************************************************************
// ********************************************************************************************
// ********************************************************************************************
